Revit 2027 API
WorksharingDisplayMode Enumeration
 Indicates which worksharing display mode a view is in.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum WorksharingDisplayMode
Public Enumeration WorksharingDisplayMode
public enum class WorksharingDisplayMode
type WorksharingDisplayMode
Members
Member name | Value | Description
CheckoutStatus | 1 |  The view is displaying the checkout status of elements.
ModelUpdates | 3 |  The view is displaying model updates.
Off | 0 |  No active worksharing display mode.
Owners | 2 |  The view is displaying the specific owners of elements.
Worksets | 4 |  The view is displaying which workset each element is assigned to.
Example
public void GetWorksharingDisplayMode(View view)
{
    // Get and Set worksharingDisplayMode of a given view
    WorksharingDisplayMode displayMode = view.GetWorksharingDisplayMode();
    Autodesk.Revit.UI.TaskDialog.Show("GetWorksharingDisplayMode", "WorksharingDisplayMode : " + displayMode);
    view.SetWorksharingDisplayMode(WorksharingDisplayMode.CheckoutStatus);
    Autodesk.Revit.UI.TaskDialog.Show("SetWorksharingDisplayMode", "CheckoutStatus was set for View: " + view.Name);
}
See Also
Reference
Autodesk.Revit.DB Namespace